ERM/src/InformationRegisters/SalesOrderResponsibles.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>SalesOrderResponsibles</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ResponsibleAR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/SalesOrderResponsiblesList/SalesOrderResponsiblesList.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SalesOrderResponsiblesList</name>
  <resources>
    <name>ResponsiblesList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/SalesOrderResponsibles/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	МассивСО = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ЭтотОбъект.ВыгрузитьКолонку("SalesOrder"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SalesOrderResponsibles.SalesOrder КАК SalesOrder,
		|	SalesOrderResponsibles.ResponsibleAR.Представление КАК ResponsibleARПредставление
		|ИЗ
		|	РегистрСведений.SalesOrderResponsibles КАК SalesOrderResponsibles
		|ГДЕ
		|	SalesOrderResponsibles.SalesOrder В(&МассивСО)
		|ИТОГИ ПО
		|	SalesOrder";
	
	Запрос.УстановитьПараметр("МассивСО", МассивСО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаSalesOrder = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НЗ = РегистрыСведений.SalesOrderResponsiblesList.СоздатьНаборЗаписей();
	МассивПредставлений = Новый Массив;
	
	Пока ВыборкаSalesOrder.Следующий() Цикл
		
		НЗ.Очистить();
		НЗ.Отбор.SalesOrder.Установить(ВыборкаSalesOrder.SalesOrder);
		МассивПредставлений.Очистить();
		
		ВыборкаДетальныеЗаписи = ВыборкаSalesOrder.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивПредставлений.Добавить(СокрЛП(ВыборкаДетальныеЗаписи.ResponsibleARПредставление));
		КонецЦикла;
		
		СтрокаНабора = НЗ.Добавить();
		СтрокаНабора.SalesOrder = ВыборкаSalesOrder.SalesOrder;
		СтрокаНабора.ResponsiblesList = СтрСоединить(МассивПредставлений, ", ");
		НЗ.Записать(Истина);
		
	КонецЦикла;
	
	
КонецПроцедуры
